wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_adc.c
/*!
    \brief      get the ADC flag bits
    \param[in]  adc_periph: ADCx(x=0,1,2,3)
    \param[in]  flag: the adc flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_WDE0: analog watchdog 0 event flag
      \arg        ADC_FLAG_EOC: end of routine sequence conversion flag
      \arg        ADC_FLAG_EOIC: end of inserted sequence conversion flag
      \arg        ADC_FLAG_STIC: start flag of inserted sequence
      \arg        ADC_FLAG_STRC: start flag of routine sequence
      \arg        ADC_FLAG_ROVF: routine data register overflow flag
      \arg        ADC_FLAG_WDE1: analog watchdog 1 event flag
      \arg        ADC_FLAG_WDE2: analog watchdog 2 event flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_flag_get(uint32_t adc_periph, uint32_t flag)
{
    FlagStatus reval = RESET;
    if(ADC_STAT(adc_periph) & flag){
        reval = SET;
    }
    return reval;
}

/*!
    \brief      enable ADC interrupt
    \param[in]  adc_periph: ADCx(x=0,1,2,3)
    \param[in]  adc_interrupt: the adc interrupt
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_WDE0: analog watchdog 0 interrupt
      \arg        ADC_INT_EOC: end of routine sequence conversion interrupt
      \arg        ADC_INT_EOIC: end of inserted sequence conversion interrupt
      \arg        ADC_INT_ROVF: routine data register overflow interrupt
      \arg        ADC_INT_WDE1: analog watchdog 1 interrupt
      \arg        ADC_INT_WDE2: analog watchdog 2 interrupt
    \param[out] none
    \retval     none
*/
void adc_interrupt_enable(uint32_t adc_periph, uint32_t adc_interrupt)
{
    ADC_CTL0(adc_periph) |= (uint32_t)adc_interrupt;
}

/*!
    \brief      disable ADC interrupt
    \param[in]  adc_periph: ADCx(x=0,1,2,3)
    \param[in]  adc_interrupt: the adc interrupt
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_WDE0: analog watchdog 0 interrupt
      \arg        ADC_INT_EOC: end of routine sequence conversion interrupt
      \arg        ADC_INT_EOIC: end of inserted sequence conversion interrupt
      \arg        ADC_INT_ROVF: routine data register overflow interrupt
      \arg        ADC_INT_WDE1: analog watchdog 1 interrupt
      \arg        ADC_INT_WDE2: analog watchdog 2 interrupt
    \param[out] none
    \retval     none
*/
void adc_interrupt_disable(uint32_t adc_periph, uint32_t adc_interrupt)
{
    ADC_CTL0(adc_periph) &= ~((uint32_t)adc_interrupt);
}

/*!
    \brief      clear the ADC flag bits
    \param[in]  adc_periph: ADCx(x=0,1,2,3)
    \param[in]  flag: the adc flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_WDE0: analog watchdog 0 event flag
      \arg        ADC_FLAG_EOC: end of routine sequence conversion flag
      \arg        ADC_FLAG_EOIC: end of inserted sequence conversion flag
      \arg        ADC_FLAG_STIC: start flag of inserted sequence
      \arg        ADC_FLAG_STRC: start flag of routine sequence
      \arg        ADC_FLAG_ROVF: routine data register overflow flag
      \arg        ADC_FLAG_WDE1: analog watchdog 1 event flag
      \arg        ADC_FLAG_WDE2: analog watchdog 2 event flag
    \param[out] none
    \retval     none
*/
void adc_flag_clear(uint32_t adc_periph, uint32_t flag)
{
    ADC_STAT(adc_periph) = ~((uint32_t)flag);
}

/*!
    \brief      get the ADC interrupt bits
    \param[in]  adc_periph: ADCx(x=0,1,2,3)
    \param[in]  int_flag: the adc interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_WDE0: analog watchdog 0 interrupt
      \arg        ADC_INT_FLAG_EOC: end of routine sequence conversion interrupt
      \arg        ADC_INT_FLAG_EOIC: end of inserted sequence conversion interrupt
      \arg        ADC_INT_FLAG_ROVF: routine data register overflow interrupt
      \arg        ADC_INT_FLAG_WDE1: analog watchdog 1 interrupt
      \arg        ADC_INT_FLAG_WDE2: analog watchdog 2 interrupt
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_interrupt_flag_get(uint32_t adc_periph, uint32_t int_flag)
{
    FlagStatus reval = RESET;
    uint32_t state = 0U;
    /* check the interrupt bits */
    switch(int_flag){
    case ADC_INT_FLAG_WDE0:
        /* get the ADC analog watchdog 0 interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_WDE0;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_WDE0IE) && state){
            reval = SET;
        }
        break;
    case ADC_INT_FLAG_EOC:
         /* get the ADC end of routine sequence conversion interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_EOC;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_EOCIE) && state){
            reval = SET;
        }
        break;
    case ADC_INT_FLAG_EOIC:
        /* get the ADC end of inserted sequence conversion interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_EOIC;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_EOICIE) && state){
            reval = SET;
        }
        break;
    case ADC_INT_FLAG_ROVF:
        /* get the ADC routine data register overflow interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_ROVF;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_ROVFIE) && state){
            reval = SET;
        }
        break;
    case ADC_INT_FLAG_WDE1:
        /* get the ADC analog watchdog 1 interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_WDE1;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_WDE1IE) && state){
            reval = SET;
        }
        break;
    case ADC_INT_FLAG_WDE2:
        /* get the ADC analog watchdog 2 interrupt bits */
        state = ADC_STAT(adc_periph) & ADC_STAT_WDE2;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_WDE2IE) && state){
            reval = SET;
        }
        break;
    default:
        break;
    }
    return reval;
}

/*!
    \brief      clear the ADC flag
    \param[in]  adc_periph: ADCx(x=0,1,2,3)
    \param[in]  int_flag: the adc interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_WDE0: analog watchdog 0 interrupt flag
      \arg        ADC_INT_FLAG_EOC: end of routine sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_EOIC: end of inserted sequence conversion interrupt flag
      \arg        ADC_INT_FLAG_ROVF: routine data register overflow interrupt flag
      \arg        ADC_INT_FLAG_WDE1: analog watchdog 1 interrupt flag
      \arg        ADC_INT_FLAG_WDE2: analog watchdog 2 interrupt flag
    \param[out] none
    \retval     none
*/
void adc_interrupt_flag_clear(uint32_t adc_periph, uint32_t int_flag)
{
    ADC_STAT(adc_periph) = ~((uint32_t)int_flag);
}

/*!
    \brief      configure the ADC sync mode
    \param[in]  sync_mode: ADC sync mode 
                only one parameter can be selected which is shown as below:
      \arg        ADC_SYNC_MODE_INDEPENDENT: all the ADCs work independently
      \arg        ADC_DUAL_ROUTINE_PARALLEL_INSERTED_PARALLEL: ADC0/1 work in combined routine parallel & inserted parallel mode
      \arg        ADC_DUAL_ROUTINE_PARALLEL_INSERTED_ROTATION: ADC0/1 work in combined routine parallel & trigger rotation mode
      \arg        ADC_DUAL_INSERTED_PARALLEL: ADC0/1 work in inserted parallel mode
      \arg        ADC_DUAL_ROUTINE_PARALLEL: ADC0/1 work in routine parallel mode
      \arg        ADC_DUAL_ROUTINE_FOLLOW_UP: ADC0/1 work in follow-up mode
      \arg        ADC_DUAL_INSERTED_TRIGGER_ROTATION: ADC0/1 work in trigger rotation mode
      \arg        ADC_TRIPLE_ROUTINE_PARALLEL_INSERTED_PARALLEL: ADC0/1/2 work in combined routine parallel & inserted parallel mode
      \arg        ADC_TRIPLE_ROUTINE_PARALLEL_INSERTED_ROTATION: ADC0/1/2 work in combined routine parallel & trigger rotation mode
      \arg        ADC_TRIPLE_INSERTED_PARALLEL: ADC0/1/2 work in inserted parallel mode
      \arg        ADC_TRIPLE_ROUTINE_PARALLEL: ADC0/1/2 work in routine parallel mode
      \arg        ADC_TRIPLE_ROUTINE_FOLLOW_UP: ADC0/1/2 work in follow-up mode
      \arg        ADC_TRIPLE_INSERTED_TRIGGER_ROTATION: ADC0/1/2 work in trigger rotation mode
    \param[out] none
    \retval     none
*/
void adc_sync_mode_config(uint32_t sync_mode)
{
    ADC_SYNCCTL(ADC0) &= ~((uint32_t)ADC_SYNCCTL_SYNCM);
    ADC_SYNCCTL(ADC0) |= (uint32_t)sync_mode;
}

/*!
    \brief      configure the delay between 2 sampling phases in ADC sync modes
    \param[in]  sample_delay:  the delay between 2 sampling phases in ADC sync modes 
                only one parameter can be selected which is shown as below:
      \arg        ADC_SYNC_DELAY_xCYCLE: x=5..20,the delay between 2 sampling phases in ADC sync modes is x ADC clock cycles
    \param[out] none
    \retval     none
*/
void adc_sync_delay_config(uint32_t sample_delay)
{
    ADC_SYNCCTL(ADC0) &= ~((uint32_t)ADC_SYNCCTL_SYNCDLY);
    ADC_SYNCCTL(ADC0) |= (uint32_t)sample_delay;
}

/*!
    \brief      configure ADC sync DMA mode selection
    \param[in]  dma_mode:  ADC sync DMA mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_SYNC_DMA_DISABLE: ADC sync DMA disabled
      \arg        ADC_SYNC_DMA_MODE0: ADC sync DMA mode 0
      \arg        ADC_SYNC_DMA_MODE1: ADC sync DMA mode 1
    \param[out] none
    \retval     none
*/
void adc_sync_dma_config(uint32_t dma_mode)
{
    ADC_SYNCCTL(ADC0) &= ~((uint32_t)ADC_SYNCCTL_SYNCDMA);
    ADC_SYNCCTL(ADC0) |= (uint32_t)dma_mode;
}

/*!
    \brief      configure ADC sync DMA engine is disabled after the end of transfer signal from DMA controller is detected
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_sync_dma_request_after_last_enable(void)
{
    ADC_SYNCCTL(ADC0) |= (uint32_t)ADC_SYNCCTL_SYNCDDM;
}

/*!
    \brief      configure ADC sync DMA engine issues requests according to the SYNCDMA bits
    \param[in]  none
    \param[out] none
    \retval     none
*/
void adc_sync_dma_request_after_last_disable(void)
{
    ADC_SYNCCTL(ADC0) &= ~((uint32_t)ADC_SYNCCTL_SYNCDDM);
}

/*!
    \brief      read ADC sync master adc routine data register
    \param[in]  none
    \param[out] none
    \retval     sync master adc routine data
*/
uint32_t adc_sync_master_adc_routine_data_read(void)
{
    return (uint32_t)(ADC_SYNCDATA & ADC_SYNCDATA_SYNCDATA0);
}

/*!
    \brief      read ADC sync slave adc routine data register
    \param[in]  none
    \param[out] none
    \retval     sync slave adc routine data
*/
uint32_t adc_sync_slave_adc_routine_data_read(void)
{
    return (uint32_t)(ADC_SYNCDATA & ADC_SYNCDATA_SYNCDATA1) >> 16U;
}
